Revit 2025 API
DuctLossMethodType Enumeration
An enumerated type listing all duct loss calculation methods for a connector.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum DuctLossMethodType
Public Enumeration DuctLossMethodType
public enum class DuctLossMethodType
type DuctLossMethodType
Members
Member name | Value | Description
NotDefined | 0 | Duct loss method is undefined.
SpecificLoss | 4 | Duct loss method is specified.
Coefficient | 6 | Duct loss method depends on the loss coefficient.
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace